## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_dns_managed_zone.primary will be created
+   resource "google_dns_managed_zone" "primary" {
+       creation_time   = (known after apply)
+       description     = "wayofthesys-com DNS zone"
+       dns_name        = "wayofthesys.com."
+       force_destroy   = false
+       id              = (known after apply)
+       managed_zone_id = (known after apply)
+       name            = "wayofthesys-com"
+       name_servers    = (known after apply)
+       project         = (known after apply)
+       visibility      = "public"
    }

  # tls_cert_request.request will be created
+   resource "tls_cert_request" "request" {
+       cert_request_pem = (known after apply)
+       id               = (known after apply)
+       key_algorithm    = (known after apply)
+       private_key_pem  = (sensitive value)

+       subject {
+           common_name  = "wayofthesys.com"
+           organization = "WayOfTheSys"
        }
    }

  # tls_locally_signed_cert.cert will be created
+   resource "tls_locally_signed_cert" "cert" {
+       allowed_uses          = [
+           "cert_signing",
+           "client_auth",
+           "digital_signature",
+           "key_encipherment",
+           "server_auth",
        ]
+       ca_cert_pem           = (known after apply)
+       ca_key_algorithm      = (known after apply)
+       ca_private_key_pem    = (sensitive value)
+       cert_pem              = (known after apply)
+       cert_request_pem      = (known after apply)
+       early_renewal_hours   = 0
+       id                    = (known after apply)
+       is_ca_certificate     = false
+       ready_for_renewal     = false
+       set_subject_key_id    = false
+       validity_end_time     = (known after apply)
+       validity_period_hours = 8760
+       validity_start_time   = (known after apply)
    }

  # tls_private_key.ca will be created
+   resource "tls_private_key" "ca" {
+       algorithm                     = "RSA"
+       ecdsa_curve                   = "P224"
+       id                            = (known after apply)
+       private_key_openssh           = (sensitive value)
+       private_key_pem               = (sensitive value)
+       private_key_pem_pkcs8         = (sensitive value)
+       public_key_fingerprint_md5    = (known after apply)
+       public_key_fingerprint_sha256 = (known after apply)
+       public_key_openssh            = (known after apply)
+       public_key_pem                = (known after apply)
+       rsa_bits                      = 2048
    }

  # tls_private_key.key will be created
+   resource "tls_private_key" "key" {
+       algorithm                     = "RSA"
+       ecdsa_curve                   = "P224"
+       id                            = (known after apply)
+       private_key_openssh           = (sensitive value)
+       private_key_pem               = (sensitive value)
+       private_key_pem_pkcs8         = (sensitive value)
+       public_key_fingerprint_md5    = (known after apply)
+       public_key_fingerprint_sha256 = (known after apply)
+       public_key_openssh            = (known after apply)
+       public_key_pem                = (known after apply)
+       rsa_bits                      = 2048
    }

  # tls_self_signed_cert.ca will be created
+   resource "tls_self_signed_cert" "ca" {
+       allowed_uses          = [
+           "cert_signing",
+           "digital_signature",
+           "key_encipherment",
        ]
+       cert_pem              = (known after apply)
+       early_renewal_hours   = 0
+       id                    = (known after apply)
+       is_ca_certificate     = true
+       key_algorithm         = (known after apply)
+       private_key_pem       = (sensitive value)
+       ready_for_renewal     = false
+       set_authority_key_id  = false
+       set_subject_key_id    = false
+       validity_end_time     = (known after apply)
+       validity_period_hours = 8760
+       validity_start_time   = (known after apply)

+       subject {
+           common_name  = "ca.local"
+           organization = "WayOfTheSys"
        }
    }

  # module.terraform-google-billing-budget.google_billing_budget.budget[0] will be created
+   resource "google_billing_budget" "budget" {
+       billing_account = "011853-711B63-995445"
+       display_name    = "global-alert"
+       id              = (known after apply)
+       name            = (known after apply)

+       amount {
+           specified_amount {
+               currency_code = "USD"
+               units         = "300"
            }
        }

+       budget_filter {
+           calendar_period        = (known after apply)
+           credit_types           = (known after apply)
+           credit_types_treatment = (known after apply)
+           labels                 = (known after apply)
+           projects               = (known after apply)
+           services               = (known after apply)
+           subaccounts            = (known after apply)

+           custom_period {
+               end_date {
+                   day   = (known after apply)
+                   month = (known after apply)
+                   year  = (known after apply)
                }

+               start_date {
+                   day   = (known after apply)
+                   month = (known after apply)
+                   year  = (known after apply)
                }
            }
        }

+       threshold_rules {
+           spend_basis       = "CURRENT_SPEND"
+           threshold_percent = 1
        }
+       threshold_rules {
+           spend_basis       = "CURRENT_SPEND"
+           threshold_percent = 0.5
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   project = "wayofthesys-cinema"

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
